In [1]:
# Imports
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv(r"D:\clv\data\online_retail.csv")
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [4]:
## Basic EDA
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

## As it can be seen inconsistent formats and null values

In [5]:
## Things Needed to be Cleaned
## Nulls ?
df.isnull().sum()
#CusotmerId Null?
df[df['CustomerID'].isnull()].head()
# Cancelled Orders
df[df['InvoiceNo'].str.startswith('C')].count()
# Quantiy Zeros
df[df['Quantity']<= 0]
# Unit Price Zero?
df[df['UnitPrice']<= 0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.0,NaN,United Kingdom
1970,536545,21134,NaN,1,2010-12-01 14:32:00,0.0,NaN,United Kingdom
1971,536546,22145,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1972,536547,37509,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1987,536549,85226A,NaN,1,2010-12-01 14:34:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
536981,581234,72817,NaN,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
538504,581406,46000M,POLYESTER FILLER PAD 45x45cm,240,2011-12-08 13:58:00,0.0,NaN,United Kingdom
538505,581406,46000S,POLYESTER FILLER PAD 40x40cm,300,2011-12-08 13:58:00,0.0,NaN,United Kingdom
538554,581408,85175,NaN,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom
538919,581422,23169,smashed,-235,2011-12-08 15:24:00,0.0,NaN,United Kingdom

In [6]:
## Fixing Formats
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [7]:
## Data Cleaning

df_clean = df.dropna(subset=['CustomerID'])
df_clean

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [8]:
## Removing Cancelled Orders
df_clean = df_clean[~df_clean['InvoiceDate'].astype(str).str.startswith('C')]

In [9]:
#Removing Unusual Price and Qunatites
df_clean = df_clean[df_clean['UnitPrice'] >= 0]
df_clean = df_clean[df_clean['Quantity'] >= 0 ]

In [10]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 397924 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397924 non-null  object
 1   StockCode    397924 non-null  object
 2   Description  397924 non-null  object
 3   Quantity     397924 non-null  int64
 4   InvoiceDate  397924 non-null  datetime64[ns]
 5   UnitPrice    397924 non-null  float64
 6   CustomerID   397924 non-null  float64
 7   Country      397924 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.3+ MB

In [11]:
df_clean.sample(n = 10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
432080,573814,20973,12 PENCIL SMALL TUBE WOODLAND,2,2011-11-01 11:31:00,0.65,13268.0,United Kingdom
136895,548003,22361,GLASS JAR DAISY FRESH COTTON WOOL,6,2011-03-29 10:39:00,2.95,18044.0,United Kingdom
308080,563935,44236,PINK/PURPLE CIRCLE CURTAIN,4,2011-08-21 16:24:00,0.79,15547.0,United Kingdom
407618,571900,BANK CHARGES,Bank Charges,1,2011-10-19 14:26:00,15.00,13263.0,United Kingdom
116204,546220,85099B,JUMBO BAG RED RETROSPOT,4,2011-03-10 12:16:00,1.95,16745.0,United Kingdom
124797,546991,22922,FRIDGE MAGNETS US DINER ASSORTED,6,2011-03-18 13:08:00,0.85,12748.0,United Kingdom
418532,572732,22029,SPACEBOY BIRTHDAY CARD,24,2011-10-25 15:21:00,0.42,18079.0,United Kingdom
362957,568531,22710,WRAP I LOVE LONDON,25,2011-09-27 13:49:00,0.42,16713.0,United Kingdom
129751,547389,22837,HOT WATER BOTTLE BABUSHKA,2,2011-03-22 16:08:00,4.65,16721.0,United Kingdom
49313,540511,21755,LOVE BUILDING BLOCK WORD,1,2011-01-09 11:34:00,5.95,14472.0,United Kingdom

In [12]:
# Saving the Cleaned Dataset
df_clean.to_csv("cleaned.csv", index = False)